import { expToLv, skillMachine, pokemonBase, battleType, skills } from './data'

import {config,Config} from '../index';

import { h } from "koishi"
import { baseFusion } from './mothed';
import { PokemonList } from '../model';

const exptolv = expToLv
const Base = pokemonBase

const pokemonCal = {
  power(a: string[], b: number,c1:PokemonList,id:string) {
    const index = c1.pokemon.findIndex((pokeId)=>pokeId.id===id)
    const nature=index==-1?{effect:'无',up:0,down:0}:c1.pokemon[index].natures
    const powerNatrue=index==-1?{
      id:'临时',
      name: '临时',
      natures: {
          effect: '无',
          up: 0,
          down: 0
      },
      natureLevel: 0,
      power: [0, 0, 0, 0, 0, 0]
  }:c1.pokemon[index]
    const powerUp= powerNatrue.power
    try {
      let c = ['0', '0', '0', '0', '0', '0']
      for (let i = 0; i < a.length; i++) {
        c[i] = String(Math.round((Number(a[i]) + 30 + powerUp[i] / 8) * b / 50 + 5))
      }
      c[nature.up] = String(Math.ceil(Number(c[nature.up]) * (1+powerNatrue.natureLevel * 0.01)))
      c[nature.down] = String(Math.floor(Number(c[nature.down]) * (1-powerNatrue.natureLevel * 0.01)))
      return c
    } catch(e) {
      return ['0', '0', '0', '0', '0', '0']
    }
  },

  exp_bar(a: number, b: number) {
    let nowExp = b / exptolv.exp_lv[a].exp * 100
    const expBar='🟩'.repeat(Math.floor(nowExp/10))+'🟨'.repeat(nowExp%10>4?1:0)+ '⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜'.substring(Math.round(nowExp/10))
    return expBar
  },

  pokeBase(a) {
    try {
      let poke = a.split('.')
      let pokeF = poke[0]
      let pokeM = poke[1]
      let BaseList = []
        BaseList = [
          String(baseFusion(Number(Base[pokeF].hp), Number(Base[pokeM].hp))),
          String(baseFusion(Number(Base[pokeF].att), Number(Base[pokeM].att))),
          String(baseFusion(Number(Base[pokeF].def), Number(Base[pokeM].def))),
          String(baseFusion(Number(Base[pokeF].spa), Number(Base[pokeM].spa))),
          String(baseFusion(Number(Base[pokeF].spd), Number(Base[pokeM].spd))),
          String(baseFusion(Number(Base[pokeF].spe), Number(Base[pokeM].spe))),]
      return BaseList
    } catch {
      return []
    }
    // try {
    //   let poke = a.split('.')
    //   let pokeF = poke[0]
    //   let pokeM = poke[1]
    //   let BaseList = []
    //     BaseList =baseFusion(pokemonBase[pokeF],pokemonBase[pokeM])
    //   return BaseList
    // } catch {
    //   return []
    // }
  },

  pokemonlist(a) {
    try {
      let pokemonNow = a.split('.')
      let pokemon_a = Number(pokemonNow[0])
      let pokemon_b = Number(pokemonNow[1])
      if (pokemon_a != pokemon_b) {
        const y = ["0", "妙蛙", "妙蛙", "妙蛙", "小火", "火", "喷火", "杰尼", "卡咪", "水箭", "绿毛", "铁甲", "巴大", "独角", "铁壳", "大针", "波波", "比比", "大比", "拉达", "拉达", "烈", "尖嘴", "阿伯", "阿伯", "皮卡", "雷", "穿山", "穿山", "尼多", "尼多", "尼多", "尼多", "尼多", "尼多", "皮皮", "皮可", "狐面", "狐面", "粉红", "粉红", "超音", "大嘴", "曼德拉", "邋遢", "笑面", "派拉", "派拉斯", "复眼", "摩鲁", "豆眼", "豆眼", "喵", "喵", "可达", "哥达", "猴", "火爆", "卡蒂", "神速", "蚊香", "蚊香", "蚊香", "斜眼", "勇吉", "智慧", "强腕", "筋肉", "怪力", "喇叭", "惊呆", "巨口", "玛瑙", "毒刺", "拳石", "隆隆", "隆隆", "火焰", "烈焰", "呆", "呆壳", "磁铁", "磁铁", "鸭嘴", "嘟嘟", "嘟利", "海", "大海", "臭", "恶臭", "吐舌", "恶脸", "鬼面", "鬼面", "邪面", "大岩", "象鼻", "贼眼", "大钳", "巨钳", "霹雳", "顽皮", "破裂", "椰果", "卡拉", "嘎啦", "飞踢", "快拳", "大舌", "瓦斯", "瓦斯", "独角", "钻角", "吉利", "蔓藤", "育儿", "喷嘴", "深海", "独角", "海洋", "珍珠", "宝石", "魔墙", "飞天", "迷唇", "电击", "鸭嘴", "钳角", "肯泰", "鲤鱼", "暴", "拉普", "豆豆眼", "伊", "鱼鳍", "雷电", "火焰", "棱角", "菊石", "刺壳", "背甲", "镰刀", "化石", "卡比", "急冻", "闪电", "火焰", "迷你", "哈克", "肥大", "超", "梦", "菊草","月桂","大","火球","火岩","火暴","小锯","蓝鳄","大力鳄","尾立","大尾立","咕","猫头","芭瓢","安瓢","圆丝","阿利","叉字","灯笼","电灯","皮","皮","宝宝","波","波克","天然","天然","咩利","茸茸","电","美丽","玛力","玛力","树","蚊香","毽子","毽子","毽子","长尾","向日","向日","蜻","乌","沼","太阳","月亮","黑暗","呆呆","梦","未知","果然","麒麟","榛果","佛烈","土龙","天","大钢","布鲁","布鲁皇","千针","巨钳","壶","赫拉","狃","熊","圈圈","熔岩","熔岩","小山","长毛","太阳","铁炮","章鱼","信使","巨翅","盔甲","戴鲁比","黑鲁","刺龙","小小","顿","多边兽","惊角","图图","无畏","战舞","迷唇","电击","鸭嘴","奶罐","幸福","雷","炎","水","幼基","沙基","班基","洛","凤","时","露力","果然","双尾","梦","乌鸦","盆","魔","小","小","小","玛","自爆","大","超甲","巨","电击","鸭嘴","波克","远古","叶","冰","天蝎","象牙","多边兽","木","森林","蜥蜴","火稚","力壮","火焰","水跃","沼跃","巨沼","拉鲁","奇鲁","超能","艾路","脱壳","隐身","铁","金属","巨金","大牙","花岩","路卡","圆陆","尖牙","烈咬","大嘴","触手","摇篮","太古","太古","头盖","战槌","盾甲","护城","请假","阿勃","夜巡","彷徨","黑夜","吼","羊驼","草苗","树林","土台","小火焰","猛火","烈焰","波","波","帝王","朝北","大朝北","独剑","双剑","坚盾","驹刀","劈斩","伦琴","波士","沙漠","美","暴","怪","亚克","仙子","海","古古","绿","帝牙","帕路","骑拉","雷吉","达克","盖诺","拉姆","捷克","雷姆","罗丝","随风","长耳","斗笠","奇鲁","诅咒","滋滋","人造","风","流氓","迭失","电","坚果","烛光","灯火","水晶","双斧","泥偶","拳","钥匙","烈箭","谜拟","火神","独首","双首","三首","红","蓝","扭扭","基拉","土居","大尾","利欧","懒人","多动","吼","小猫","勒克","可可","可","大颚","超音波","丑丑","宝","甲壳","齿轮","齿轮","索罗","含羞","带刺","飘","卷毛","蘑蘑","怨影","单卵","双卵","木","黑眼","混混","哭哭","电","种子","牙","斧","泥偶","箭","火箭","燃烧","泥巴",];
        const x = ["0", "蛙种子", "蛙草", "蛙花", "火龙", "恐龙", "火龙", "龟", "龟", "龟", "毛虫", "甲蛹", "蝶", "角虫", "昆蛹", "针蜂", "雀", "鸟", "雕", "鼠", "巨鼠", "雀", "雁", "蛇", "毒蛇", "丘", "丘", "兽", "鼠王", "兰", "娜", "王后", "朗", "力诺", "王", "皮皮", "可西", "六尾狐", "九尾狐", "气球", "丁", "蝠", "蝠", "草", "臭花", "霸王花", "蟹", "菇蟹", "球", "飞蛾", "地鼠", "地鼠", "喵", "喵豹", "鸭", "鸭", "怪球", "猴", "狗", "猎犬", "蝌蚪", "蛙", "泳蛙", "凯西", "波拉", "胡地", "腕力", "兄贵", "怪力", "豆芽", "豆炮", "豆笼", "水母", "水母", "拳石", "岩石", "岩怪", "火马", "烈马", "河马", "河马兽", "磁怪", "磁铁怪", "葱鸭", "双头鸟", "三头鸟", "海狮", "海狮", "泥浆", "泥巴", "贝", "刺贝", "瓦斯", "怨灵", "鬼", "岩蛇", "貘", "貘人", "蟹", "巨蟹", "电球", "雷弹", "蛋蛋", "椰树", "卡拉", "嘎啦", "郎", "郎", "舌头", "瓦斯", "瓦斯", "犀牛", "犀兽", "蛋", "怪", "袋兽", "海马", "海龙", "金鱼", "鱼王", "海星", "海星", "人偶", "螳螂", "姐", "兽", "火兽", "甲虫", "黄牛", "鱼王", "鲤龙", "贝龙", "水晶泥", "伊布", "伊布", "伊布", "伊布", "兽", "蜗牛", "贝壳兽", "甲虫", "盔虫", "翼龙", "巨兽", "鸟", "鸟", "鸟", "龙", "龙", "龙", "梦", "幻","叶","叶","竺葵","鼠","鼠","暴兽","锯鳄","鳄","鳄","尾立","尾立","咕","夜鹰","虫","虫","蛛","蛛","蝠","鱼","怪","丘","宝宝","丁","克比","基古","雀","鸟","羊","羊","龙","花","露","露丽","才怪","蛙皇","草","花","棉","怪手","种子","花怪","蜻蜓","波","王","伊布","伊布","鸦","王","妖","图腾","翁","奇亚","果球","托斯","弟弟","蝎","蛇","狗","狗皇","鱼","螳螂","壶","克罗斯","拉","宝宝","熊","虫","蜗牛","猪","猪","珊瑚","鱼","桶","鸟","飞鱼","鸟","鲁比","加","王","象","甲","2型","鹿","犬","小子","郎","娃","怪","宝宝","牛","蛋","公","帝","君","拉斯","拉斯","拉斯","奇亚","王","拉比","力丽","果然","怪手","妖魔","头头","才怪","尼尼","福蛋","卡比兽","球飞鱼","狃拉","磁怪","舌舔","狂犀","蔓藤","魔兽","炎兽","基斯","巨蜓","伊布","伊布","王","猪","乙型","守宫","蜥蜴","王","鸡","鸡","鸡","鱼","鱼","怪","拉丝","莉安","女皇","雷朵","忍者","变色龙","哑铃","怪","怪","狸","怪","利欧","鲨","陆鲨","陆鲨","娃","百合","百合","羽虫","盔甲","龙","龙","龙","龙","王","梭鲁","灵","夜灵","魔灵","鲸王","宙斯","龟","龟","龟","猴","猴","猴","加曼","皇子","拿波","鼻","鼻","鞘","鞘","怪","小兵","司令","猫","可多拉","蜻蜓","纳斯","飞龙","齿轮怪","索罗","伊布","皇牙","拉多","龙","卢卡","奇亚","帝纳","奇卡斯","莱伊","赛克特","莱希","罗姆","雷姆","雷朵","球","兔","菇","莉安","娃娃","托姆","细胞卵","妖精","鳄","棺","蜘蛛","哑铃","灵","幽灵","灯火灵","战龙","巨人","海参","圈儿","鹰","丘","蛾","龙","暴龙","恶龙","水都","水都","奇希斯","祈","忍士","狸","路","獭","猿","鲸","小猫","猫","多拉","多拉","蚂蚁","音波虫","鱼","龙","龙","齿轮","齿轮","索罗","花苞","蔷薇","球","卷耳","蘑菇","娃娃","细胞球","细胞球","棉球","鳄","鳄","面具","虫","铁球","牙","牙龙","人","雀","雀","虫","鱼",]
        let name1 = x[pokemon_a]
        let name2 = y[pokemon_b]
        let name3 = name2 + name1
        return name3
      } else {
        const pokemonList = ["0", "妙蛙种子", "妙蛙草", "妙蛙花", "小火龙", "火恐龙", "喷火龙", "杰尼龟", "卡咪龟", "水箭龟", "绿毛虫", "铁甲蛹", "巴大蝶", "独角虫", "铁壳昆", "大针蜂", "波波", "比比鸟", "比雕", "小拉达", "拉达", "烈雀", "大嘴雀", "阿伯蛇", "阿伯怪", "皮卡丘", "雷丘", "穿山鼠", "穿山王", "尼多兰", "尼多娜", "尼多后", "尼多朗", "尼多力诺", "尼多王", "皮皮", "皮可西", "六尾", "九尾", "胖丁", "胖可丁", "超音蝠", "大嘴蝠", "走路草", "臭臭花", "霸王花", "派拉斯", "派拉斯特", "毛球", "摩鲁蛾", "地鼠", "三地鼠", "喵喵", "喵老大", "可达鸭", "哥达鸭", "猴怪", "火爆猴", "卡蒂狗", "风速狗", "蚊香蝌蚪", "蚊香蛙", "蚊香游士", "凯西", "勇吉拉", "胡地", "腕力", "豪力", "怪力", "喇叭芽", "口呆花", "大食花", "玛瑙水母", "毒刺水母", "小拳石", "隆隆石", "隆隆岩", "小火马", "烈焰马", "呆呆兽", "呆壳兽", "小磁怪", "三合一磁怪", "大葱鸭", "嘟嘟", "嘟嘟利", "小海狮", "白海狮", "臭泥", "臭臭泥", "大舌贝", "刺甲贝", "鬼斯", "鬼斯通", "耿鬼", "大岩蛇", "催眠貘", "引梦貘人", "大钳蟹", "巨钳蟹", "霹雳电球", "顽皮雷弹", "蛋蛋", "椰蛋树", "卡拉卡拉", "嘎啦嘎啦", "飞腿郎", "快拳郎", "大舌头", "瓦斯弹", "双弹瓦斯", "独角犀牛", "钻角犀兽", "吉利蛋", "蔓藤怪", "袋兽", "墨海马", "刺海龙", "角金鱼", "金鱼王", "海星星", "宝石海星", "魔墙人偶", "飞天螳螂", "迷唇姐", "电击兽", "鸭嘴火兽", "凯罗斯", "肯泰罗", "鲤鱼王", "暴鲤龙", "拉普拉斯", "百变怪", "伊布", "水伊布", "雷伊布", "火伊布", "多边兽", "菊石兽", "多刺菊石兽", "化石盔", "镰刀盔", "化石翼龙", "卡比兽", "急冻鸟", "闪电鸟", "火焰鸟", "迷你龙", "哈克龙", "快龙", "超梦", "梦幻","菊草叶","月桂叶","大竺葵","火球鼠","火岩鼠","火暴兽","小锯鳄","蓝鳄","大力鳄","尾立","大尾立","咕咕","猫头夜鹰","芭瓢虫","安瓢虫","圆丝蛛","阿利多斯","叉字蝠","灯笼鱼","电灯怪","皮丘","皮宝宝","宝宝丁","波克比","波克基古","天然雀","天然鸟","咩利羊","茸茸羊","电龙","美丽花","玛力露","玛力露丽","树才怪","蚊香蛙皇","毽子草","毽子花","毽子棉","长尾怪手","向日种子","向日花怪","蜻蜻蜓","乌波","沼王","太阳伊布","月亮伊布","黑暗鸦","呆呆王","梦妖","未知图腾","果然翁","麒麟奇","榛果球","佛烈托斯","土龙弟弟","天蝎","大钢蛇","布鲁","布鲁皇","千针鱼","巨钳螳螂","壶壶","赫拉克罗斯","狃拉","熊宝宝","圈圈熊","熔岩虫","熔岩蜗牛","小山猪","长毛猪","太阳珊瑚","铁炮鱼","章鱼桶","信使鸟","巨翅飞鱼","盔甲鸟","戴鲁比","黑鲁加","刺龙王","小小象","顿甲","多边兽2型","惊角鹿","图图犬","无畏小子","战舞郎","迷唇娃","电击怪","鸭嘴宝宝","大奶罐","幸福蛋","雷公","炎帝","水君","幼基拉斯","沙基拉斯","班基拉斯","洛奇亚","凤王","时拉比","露力丽","小果然","双尾怪手","梦妖魔","乌鸦头头","盆才怪","魔尼尼","小福蛋","小卡比兽","小球飞鱼","玛狃拉","自爆磁怪","大舌舔","超甲狂犀","巨蔓藤","电击魔兽","鸭嘴炎兽","波克基斯","远古巨蜓","叶伊布","冰伊布","天蝎王","象牙猪","多边兽乙型","木守宫","森林蜥蜴","蜥蜴王","火稚鸡","力壮鸡","火焰鸡","水跃鱼","沼跃鱼","巨沼怪","拉鲁拉丝","奇鲁莉安","沙奈朵","艾路雷朵","脱壳忍者","变隐龙","铁哑铃","金属怪","巨金怪","大牙狸","花岩怪","路卡利欧","圆陆鲨","尖牙陆鲨","烈咬陆鲨","大嘴娃","触手百合","摇篮百合","太古羽虫","太古盔甲","头盖龙","战槌龙","盾甲龙","护城龙","请假王","阿勃梭鲁","夜巡灵","彷徨夜灵","黑夜魔灵","吼鲸王","阿尔宙斯","草苗龟","树林龟","土台龟","小火焰猴","猛火猴","烈焰猴","波加曼","波皇子","帝王拿波","朝北鼻","大朝北鼻","独剑鞘","双剑鞘","坚盾剑怪","驹刀小兵","劈斩司令","伦琴猫","波士可多拉","沙漠蜻蜓","美纳斯","暴飞龙","齿轮怪","索罗亚克","仙子伊布","盖欧卡","固拉多","烈空坐","帝牙卢卡","帕路奇亚","骑拉帝纳","雷吉奇卡斯","达克莱伊","盖诺赛克特","莱希拉姆","捷克罗姆","酋雷姆","罗丝雷朵","随风球","长耳兔","斗笠菇","铁面忍者","诅咒娃娃","洛托姆","人造细胞卵","风妖精","流氓鳄","迭失棺","电蜘蛛","坚果哑铃","烛光灵","灯火幽灵","水晶灯火灵","双斧战龙","泥偶巨人","拳海参","钥圈儿","烈箭鹰","谜拟丘","火神蛾","单首龙","双首暴龙","三首恶龙","拉帝亚斯","拉帝欧斯","代欧奇希斯","基拉祈","土居忍士","大尾狸","利欧路","懒人獭","过动猿","吼吼鲸","小猫怪","勒克猫","可可多拉","可多拉","大颚蚁","超音波幼虫","丑丑鱼","宝贝龙","甲壳龙","齿轮儿","齿轮组","索罗亚","含羞苞","毒蔷薇","飘飘球","卷卷耳","蘑蘑菇","怨影娃娃","单卵细胞球","双卵细胞球","木棉球","黑眼鳄","混混鳄","哭哭面具","电电虫","种子铁球","牙牙","斧牙龙","泥偶小人","小箭雀","火箭雀","燃烧虫","泥巴鱼",]
        return pokemonList[pokemon_a]
      }
    } catch {
      return '空精灵球'
    }
  },

  pokemonzajiao(a: string, b: string) {
    try {
      let pokemon_a = Number(a.split('.')[0])
      let pokemon_b = Number(b.split('.')[1])
      const y = ["0", "妙蛙", "妙蛙", "妙蛙", "小火", "火", "喷火", "杰尼", "卡咪", "水箭", "绿毛", "铁甲", "巴大", "独角", "铁壳", "大针", "波波", "比比", "大比", "拉达", "拉达", "烈", "尖嘴", "阿伯", "阿伯", "皮卡", "雷", "穿山", "穿山", "尼多", "尼多", "尼多", "尼多", "尼多", "尼多", "皮皮", "皮可", "狐面", "狐面", "粉红", "粉红", "超音", "大嘴", "曼德拉", "邋遢", "笑面", "派拉", "派拉斯", "复眼", "摩鲁", "豆眼", "豆眼", "喵", "喵", "可达", "哥达", "猴", "火爆", "卡蒂", "神速", "蚊香", "蚊香", "蚊香", "斜眼", "勇吉", "智慧", "强腕", "筋肉", "怪力", "喇叭", "惊呆", "巨口", "玛瑙", "毒刺", "拳石", "隆隆", "隆隆", "火焰", "烈焰", "呆", "呆壳", "磁铁", "磁铁", "鸭嘴", "嘟嘟", "嘟利", "海", "大海", "臭", "恶臭", "吐舌", "恶脸", "鬼面", "鬼面", "邪面", "大岩", "象鼻", "贼眼", "大钳", "巨钳", "霹雳", "顽皮", "破裂", "椰果", "卡拉", "嘎啦", "飞踢", "快拳", "大舌", "瓦斯", "瓦斯", "独角", "钻角", "吉利", "蔓藤", "育儿", "喷嘴", "深海", "独角", "海洋", "珍珠", "宝石", "魔墙", "飞天", "迷唇", "电击", "鸭嘴", "钳角", "肯泰", "鲤鱼", "暴", "拉普", "豆豆眼", "伊", "鱼鳍", "雷电", "火焰", "棱角", "菊石", "刺壳", "背甲", "镰刀", "化石", "卡比", "急冻", "闪电", "火焰", "迷你", "哈克", "肥大", "超", "梦", "菊草","月桂","大","火球","火岩","火暴","小锯","蓝鳄","大力鳄","尾立","大尾立","咕","猫头","芭瓢","安瓢","圆丝","阿利","叉字","灯笼","电灯","皮","皮","宝宝","波","波克","天然","天然","咩利","茸茸","电","美丽","玛力","玛力","树","蚊香","毽子","毽子","毽子","长尾","向日","向日","蜻","乌","沼","太阳","月亮","黑暗","呆呆","梦","未知","果然","麒麟","榛果","佛烈","土龙","天","大钢","布鲁","布鲁皇","千针","巨钳","壶","赫拉","狃","熊","圈圈","熔岩","熔岩","小山","长毛","太阳","铁炮","章鱼","信使","巨翅","盔甲","戴鲁比","黑鲁","刺龙","小小","顿","多边兽","惊角","图图","无畏","战舞","迷唇","电击","鸭嘴","奶罐","幸福","雷","炎","水","幼基","沙基","班基","洛","凤","时","露力","果然","双尾","梦","乌鸦","盆","魔","小","小","小","玛","自爆","大","超甲","巨","电击","鸭嘴","波克","远古","叶","冰","天蝎","象牙","多边兽","木","森林","蜥蜴","火稚","力壮","火焰","水跃","沼跃","巨沼","拉鲁","奇鲁","超能","艾路","脱壳","隐身","铁","金属","巨金","大牙","花岩","路卡","圆陆","尖牙","烈咬","大嘴","触手","摇篮","太古","太古","头盖","战槌","盾甲","护城","请假","阿勃","夜巡","彷徨","黑夜","吼","羊驼","草苗","树林","土台","小火焰","猛火","烈焰","波","波","帝王","朝北","大朝北","独剑","双剑","坚盾","驹刀","劈斩","伦琴","波士","沙漠","美","暴","怪","亚克","仙子","海","古古","绿","帝牙","帕路","骑拉","雷吉","达克","盖诺","拉姆","捷克","雷姆","罗丝","随风","长耳","斗笠","奇鲁","诅咒","滋滋","人造","风","流氓","迭失","电","坚果","烛光","灯火","水晶","双斧","泥偶","拳","钥匙","烈箭","谜拟","火神","独首","双首","三首","红","蓝","扭扭","基拉","土居","大尾","利欧","懒人","多动","吼","小猫","勒克","可可","可","大颚","超音波","丑丑","宝","甲壳","齿轮","齿轮","索罗","含羞","带刺","飘","卷毛","蘑蘑","怨影","单卵","双卵","木","黑眼","混混","哭哭","电","种子","牙","斧","泥偶","箭","火箭","燃烧","泥巴",];
      const x = ["0", "蛙种子", "蛙草", "蛙花", "火龙", "恐龙", "火龙", "龟", "龟", "龟", "毛虫", "甲蛹", "蝶", "角虫", "昆蛹", "针蜂", "雀", "鸟", "雕", "鼠", "巨鼠", "雀", "雁", "蛇", "毒蛇", "丘", "丘", "兽", "鼠王", "兰", "娜", "王后", "朗", "力诺", "王", "皮皮", "可西", "六尾狐", "九尾狐", "气球", "丁", "蝠", "蝠", "草", "臭花", "霸王花", "蟹", "菇蟹", "球", "飞蛾", "地鼠", "地鼠", "喵", "喵豹", "鸭", "鸭", "怪球", "猴", "狗", "猎犬", "蝌蚪", "蛙", "泳蛙", "凯西", "波拉", "胡地", "腕力", "兄贵", "怪力", "豆芽", "豆炮", "豆笼", "水母", "水母", "拳石", "岩石", "岩怪", "火马", "烈马", "河马", "河马兽", "磁怪", "磁铁怪", "葱鸭", "双头鸟", "三头鸟", "海狮", "海狮", "泥浆", "泥巴", "贝", "刺贝", "瓦斯", "怨灵", "鬼", "岩蛇", "貘", "貘人", "蟹", "巨蟹", "电球", "雷弹", "蛋蛋", "椰树", "卡拉", "嘎啦", "郎", "郎", "舌头", "瓦斯", "瓦斯", "犀牛", "犀兽", "蛋", "怪", "袋兽", "海马", "海龙", "金鱼", "鱼王", "海星", "海星", "人偶", "螳螂", "姐", "兽", "火兽", "甲虫", "黄牛", "鱼王", "鲤龙", "贝龙", "水晶泥", "伊布", "伊布", "伊布", "伊布", "兽", "蜗牛", "贝壳兽", "甲虫", "盔虫", "翼龙", "巨兽", "鸟", "鸟", "鸟", "龙", "龙", "龙", "梦", "幻","叶","叶","竺葵","鼠","鼠","暴兽","锯鳄","鳄","鳄","尾立","尾立","咕","夜鹰","虫","虫","蛛","蛛","蝠","鱼","怪","丘","宝宝","丁","克比","基古","雀","鸟","羊","羊","龙","花","露","露丽","才怪","蛙皇","草","花","棉","怪手","种子","花怪","蜻蜓","波","王","伊布","伊布","鸦","王","妖","图腾","翁","奇亚","果球","托斯","弟弟","蝎","蛇","狗","狗皇","鱼","螳螂","壶","克罗斯","拉","宝宝","熊","虫","蜗牛","猪","猪","珊瑚","鱼","桶","鸟","飞鱼","鸟","鲁比","加","王","象","甲","2型","鹿","犬","小子","郎","娃","怪","宝宝","牛","蛋","公","帝","君","拉斯","拉斯","拉斯","奇亚","王","拉比","力丽","果然","怪手","妖魔","头头","才怪","尼尼","福蛋","卡比兽","球飞鱼","狃拉","磁怪","舌舔","狂犀","蔓藤","魔兽","炎兽","基斯","巨蜓","伊布","伊布","王","猪","乙型","守宫","蜥蜴","王","鸡","鸡","鸡","鱼","鱼","怪","拉丝","莉安","女皇","雷朵","忍者","变色龙","哑铃","怪","怪","狸","怪","利欧","鲨","陆鲨","陆鲨","娃","百合","百合","羽虫","盔甲","龙","龙","龙","龙","王","梭鲁","灵","夜灵","魔灵","鲸王","宙斯","龟","龟","龟","猴","猴","猴","加曼","皇子","拿波","鼻","鼻","鞘","鞘","怪","小兵","司令","猫","可多拉","蜻蜓","纳斯","飞龙","齿轮怪","索罗","伊布","皇牙","拉多","龙","卢卡","奇亚","帝纳","奇卡斯","莱伊","赛克特","莱希","罗姆","雷姆","雷朵","球","兔","菇","莉安","娃娃","托姆","细胞卵","妖精","鳄","棺","蜘蛛","哑铃","灵","幽灵","灯火灵","战龙","巨人","海参","圈儿","鹰","丘","蛾","龙","暴龙","恶龙","水都","水都","奇希斯","祈","忍士","狸","路","獭","猿","鲸","小猫","猫","多拉","多拉","蚂蚁","音波虫","鱼","龙","龙","齿轮","齿轮","索罗","花苞","蔷薇","球","卷耳","蘑菇","娃娃","细胞球","细胞球","棉球","鳄","鳄","面具","虫","铁球","牙","牙龙","人","雀","雀","虫","鱼",]
      let name3 = y[pokemon_b] + x[pokemon_a]
      let dan = pokemon_a + '.' + pokemon_b
      return [name3, dan]
    } catch {
      return 0
    }
  },

  mathRandomInt(a: number, b: number) {
    if (a > b) {
      var c = a;
      a = b;
      b = c;
    }
    return Math.floor(Math.random() * (b - a + 1) + a);
  },

  expCal(a: number, b: number) {
    let lv = a
    let exp = b
    let lvup = exp / exptolv.exp_lv[lv].exp
    if (lvup > 1) {
      exp = exp - exptolv.exp_lv[lv].exp
      lv = lv + Math.floor(lvup)
    } else {
      lv = a
      exp = b
    }
    return [lv, exp]
  },

  pokemomPic(a: string, b: boolean) {
    try {
      let pokemonNow = a.split('.')
      let pokemon_a = Number(pokemonNow[0])
      let pokemon_b = Number(pokemonNow[1])

      if (b) { 
        return h.image(`${config.图片源}/fusion/${pokemon_a}/${pokemon_a}.${pokemon_b}.png`) } else {
        return h.image(`${config.图片源}/fusion/${pokemon_a}/${pokemon_a}.png`)
      }



    } catch {
      return `出错啦`
    }
  },

  

  pokemonskill(a: number) {
  return Math.floor(Math.random() * (skills.skills.length-1)) + 1
},

  skillbag(a: string[]) {
   const b=a.map(Number).sort((a, b) => a - b)
    let skill = []
    for (let i = 0; i < b.length; i++) {
      skill.push(skillMachine.skill[b[i]].skill)
      if ((i + 1) % 5 === 0 && i !== 0) {
        skill.splice(i, 1, skill[i] + '💿\n')
      } else {
        skill.splice(i, 1, skill[i] + '💿')
      }
    }
    return skill.join('\n')
  },

  findskillId(a: string) {
    let findone = skillMachine.skill.find((skill) => {
      return skill.skill === a
    })
    return findone?.id ? findone.id : 0
  },

  skillinfo(a: string[],c:string, b: boolean=false) {
    let skill = []
    let m=0
    for (let i = 0; i < a.length; i++) {
      if(b){
        if(skillMachine.skill[a[i]]?.type===c){
          skill[m] = a[i]
          m++
        }
      }else{skill[i] = a[i]}
    }
    console.log(skill)
    let skillInfo = []
    for(let j=0;j<skill.length;j++) {
      skillInfo.push(`${skillMachine.skill[skill[j]].skill}:${skillMachine.skill[skill[j]].Dam} 类型:${skillMachine.skill[skill[j]].category===1?'物理':'特殊'} 属性:${skillMachine.skill[skill[j]].type}`)
    }
    return `你的技能背包符合条件的技能是：
---
${"```"}
${skillInfo.join('\n')}
${"```"}
`
  }
}


export default pokemonCal
